Titanic Dataset

1. Import & look at data
2. Prepare categorical data
3. Prepare numerical data
4. Create model
5. Train model
6. ???
7. Profit

In [1]:
import pandas as pd 

titanic_path = '../../titanic/train.csv'

df = pd.read_csv(titanic_path, quotechar='"')

In [2]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

Keep only desired rows and rearrange for easier view:

In [3]:
preferredOrder = ['Sex', 'Pclass', 'Cabin', 'Embarked', 'SibSp', 'Parch', 'Age', 'Fare', 'Survived']
df = df[preferredOrder]

In [4]:
df.head(3)

      Sex  Pclass Cabin Embarked  SibSp  Parch   Age     Fare  Survived
0    male       3   NaN        S      1      0  22.0   7.2500         0
1  female       1   C85        C      1      0  38.0  71.2833         1
2  female       3   NaN        S      0      0  26.0   7.9250         1

# Prepare categorical data

We will use these 4 as categories:
 - Sex
 - Pclass
 - Cabin
 - Embarked

In [5]:
categorical_data = preferredOrder[:4]
categorical_data

['Sex', 'Pclass', 'Cabin', 'Embarked']

`Cabin` values need to be placed into categories.

In [6]:
df['Cabin'].values[:20]

array([nan, 'C85', nan, 'C123', nan, nan, 'E46', nan, nan, nan, 'G6',
       'C103', nan, nan, nan, nan, nan, nan, nan, nan], dtype=object)

In [7]:
def cleanCabin(el):
    if isinstance(el, str):
        return el[:1]
    else:
        return '0'
df['Cabin'] = df['Cabin'].apply(cleanCabin)
df['Cabin'].values[:20]

array(['0', 'C', '0', 'C', '0', '0', 'E', '0', '0', '0', 'G', 'C', '0',
       '0', '0', '0', '0', '0', '0', '0'], dtype=object)

Keras has `to_categorical` method for **one hot encoding** of data, but it requires natural number input.

We will create our own conversion

In [8]:
def convert_to_natural_number(x, temp_dict):
    if x in temp_dict:
        return temp_dict[x]
    else:
        temp_dict[x] = temp_dict['curr_count']
        temp_dict['curr_count'] += 1
        return temp_dict[x]

In [9]:
def categorical_column_to_number(col):
    temp_dict = temp_dict = {'curr_count': 0}
    df[col] = df[col].apply(convert_to_natural_number, args=(temp_dict,))

In [10]:
df[categorical_data].head(10)

      Sex  Pclass Cabin Embarked
0    male       3     0        S
1  female       1     C        C
2  female       3     0        S
3  female       1     C        S
4    male       3     0        S
5    male       3     0        Q
6    male       1     E        S
7    male       3     0        S
8  female       3     0        S
9  female       2     0        C

In [11]:
for col in categorical_data:
    categorical_column_to_number(col)

In [12]:
df[categorical_data].head(10)

   Sex  Pclass  Cabin  Embarked
0    0       0      0         0
1    1       1      1         1
2    1       0      0         0
3    1       1      1         0
4    0       0      0         0
5    0       0      0         2
6    0       1      2         0
7    0       0      0         0
8    1       0      0         0
9    1       2      0         1

In [13]:
from keras.utils import to_categorical

Using TensorFlow backend.

In [14]:
lol = df['Pclass']
cats = to_categorical(lol)
cats

array([[ 1.,  0.,  0.],
       [ 0.,  1.,  0.],
       [ 1.,  0.,  0.],
       ...,
       [ 1.,  0.,  0.],
       [ 0.,  1.,  0.],
       [ 1.,  0.,  0.]], dtype=float32)

# Prepare numerical data

We will use these 4 as numbers:
 - SibSp (# of **sib**lings / # of **sp**ouses)
 - Parch (# of **par**ent / # of **ch**ildren)
 - Age
 - Fare

In [15]:
numerical_data = preferredOrder[4:8]
numerical_data

['SibSp', 'Parch', 'Age', 'Fare']

In [16]:
import math

def normalize(x, colMax):
    if math.isnan(x):
        return 0
    if isinstance(x, float):
        return x / colMax
    elif isinstance(x, int):
        return float(x) / colMax
    else:
        return 0

In [17]:
def applyNormalize(col):
    column_max = df[col].max()
    df[col] = df[col].apply(normalize, args=(column_max,))

In [18]:
for col in numerical_data:
    applyNormalize(col)

In [19]:
df[numerical_data].head(3)

   SibSp  Parch    Age      Fare
0  0.125    0.0  0.275  0.014151
1  0.125    0.0  0.475  0.139136
2  0.000    0.0  0.325  0.015469

In [20]:
df[numerical_data].describe()

            SibSp       Parch         Age        Fare
count  891.000000  891.000000  891.000000  891.000000
mean     0.065376    0.063599    0.297491    0.062858
std      0.137843    0.134343    0.219951    0.096995
min      0.000000    0.000000    0.000000    0.000000
25%      0.000000    0.000000    0.075000    0.015440
50%      0.000000    0.000000    0.300000    0.028213
75%      0.125000    0.000000    0.437500    0.060508
max      1.000000    1.000000    1.000000    1.000000

Notice that max is now 1